/**
 *   file: codeM_data.h
 *   created at: 25 Oct 2023
 *
 *   extra data about the codem ID
 *
 *   city code: the first three digits of a codem, indicate
 *   the city of issuance; referred to as the city code.
 *
 *   city_code is space separated, xxxyyyzzz means that
 *   the corresponding city has xxx, yyy and zzz valid codes.
 *   city_name is null-byte ('\0') separated.
 *
 *   these two constants should exclusively used by
 *   introduced functions and macros in codeM.c file.
 *
 *   Resources:
 *     https://www.yasa.co/%DA%A9%D8%AF-%D9%85%D9%84%DB%8C-%D9%88-%D8%B4%D9%87%D8%B1-%D9%85%D8%AD%D9%84-%D8%B5%D8%AF%D9%88%D8%B1-%D8%A2%D9%86-%D8%B4%D9%87%D8%B1-%D9%85%D8%AD%D9%84-%D8%AA%D9%88%D9%84%D8%AF/
 */
#ifndef CODEM_DATA__H__
#define CODEM_DATA__H__

/* count of cites */
#define CITY_COUNT 476 
/* length of a city code */
#define CC_LEN 3 

const char city_code[] = "\
169 170 149150 171 168 136137138 545 505 636 164165 172 623 506 519 \
154155 567 173 159160 604 274275 295 637 292 492 289 677 294 493 279280 \
288 284285 638 291 640 293 675 282283 286287 296297 290 400401 404405 \
397 398399 647 502 584 402403 392393 395396 386387 503 444 551 447 561 \
445 718 083 446 448 552 543 442443 051 052053 058 055 617 057 618 059060 \
061062 544 056 571 593 667 348 586 338339 343344 346 337 554 469 537 345 \
470 341342 483484 557 418 416417 412413 592 612 613 406407 421 598 419 \
385 420 528 213214 205206 498 568 711 217218 221 582 483 625 576 578 \
227 208209 225 577 712 215216 626 627 579 713 499 222 219220 500501 623 \
497 223 689 487 226 224 486 211212 628 202203 531 488 261 273 630 264 \
518 631 258259 570 265 268269 653 517 569 267 262263 593 266 693 271272 \
694 270 516 333334 691 323322 595 395 641 596 336 335 496 337 324325 394 \
330 332 331 687 422423 599 600 688 424425 426 550 697 384 377378 558 385 \
646 375376 372373 379380 383 674 381382 676 722 542 312313 317 310311 \
302303 583 321 382 304305 536 605 308309 306307 319 313314 606 320 698 \
298299 535 315316 318 607 608 508 538 728 509 438439 580 590 559 588 \
431432 037038 702 240241 670 648 252 678 253 649 513 546 671 246247 654 \
548 547 655 248249 253 514 665 673 228229230 679 256257 244245 681 723 \
236237 683 656 250251 515 242243 238239 657 255 684 700 642 457 456 \
458459 460 530 520 358359 682 703 364365 371 701 720 366367 704 361362 \
369370 635 668 533 705 699 669 725 597 611 525 181 527 585 685 663 \
192193 174175 183184 481 706 194195 185186 182 199200 198 662 190191 692 \
189 707 526 187188 729 730 196197 661 680 643 562 572 074 644 072073 \
069070 521 573 522 724 076 077 650 574 078079 081 084 651 086087 089090 \
553 091 092093094 097 098 096 105106 063 067068 075 591 082 635 524 468 \
465 461462 467 632 555 633 629 466 696 721 064065 523 652 719 716 085 088 \
563 529 353 349350 355 609 351352 354 732 357 532 610 356 556 658 \
001002003004005006007008 011 020 025 015 043 666 489 044045 048049 490491 \
695 659 031032 664 717 041042 471472 454 581 449450 616 534 455 451 726 \
634 453 727 452 145146 731 690 601 504 163 714 715 566 166167 161162 686 \
603 619 118 127128129 620 621 549 564 575 113114 122 540 660 120 512 \
510511 119 115 112 110111 125126 565 121 116117 541 622 124 108109 123 \
428427 507 158 615 152153";


const char city_name[] = "\
آذرشهر\0\
اسکو\0\
اهر\0\
بستان آباد\0\
بناب\0\
تبریز\0\
ترکمانچای\0\
جلفا\0\
چاروایماق\0\
سراب\0\
شبستر\0\
صوفیان\0\
عجب شیر\0\
کلیبر\0\
مراغه\0\
ورزقان\0\
هریس\0\
هشترود\0\
هوراند\0\
ارومیه\0\
اشنویه\0\
انزل\0\
بوکان\0\
پلدشت\0\
پیرانشهر\0\
تخت سلیمان\0\
تکاب\0\
چایپاره\0\
خوی\0\
سردشت\0\
سلماس\0\
سیلوانه\0\
سیه چشمه(چالدران)\0\
شوط\0\
شاهین دژ\0\
کشاورز\0\
ماکو\0\
مهاباد\0\
میاندوآب\0\
نقده\0\
اسدآباد\0\
بهار\0\
تویسرکان\0\
رزن\0\
شراء و پیشخوار\0\
فامنین\0\
قلقل رود\0\
کبودرآهنگ\0\
ملایر\0\
نهاوند\0\
همدان\0\
ابرکوه\0\
اردکان\0\
اشکذر\0\
بافق\0\
بهاباد\0\
تفت\0\
دستگردان\0\
طبس\0\
مهریز\0\
میبد\0\
نیر\0\
هرات و مروست\0\
یزد\0\
آشتیان\0\
اراک\0\
تفرش\0\
خمین\0\
خنداب\0\
دلیجان\0\
زرند مرکزی\0\
ساوه\0\
سربند\0\
فراهان\0\
محلات\0\
وفس\0\
هندودر\0\
ابوموسی\0\
بستک\0\
بشاگرد\0\
بندرعباس\0\
بندرلنگه\0\
جاسک\0\
حاجی آباد\0\
خمیر\0\
رودان\0\
فین\0\
قشم\0\
گاوبندی\0\
میناب\0\
ازنا\0\
اشترینان\0\
الشتر\0\
الیگودرز\0\
بروجرد\0\
پاپی\0\
چغلوندی\0\
چگنی\0\
خرم آباد\0\
دورود\0\
رومشکان\0\
کوهدشت\0\
ملاوی(پلدختر)\0\
نورآباد(دلفان)\0\
ویسیان\0\
آمل\0\
بابل\0\
بابلسر\0\
بندپی\0\
بندپی شرقی\0\
بهشهر\0\
تنکابن\0\
جویبار\0\
چالوس\0\
چمستان\0\
چهاردانگه\0\
دودانگه\0\
رامسر\0\
ساری\0\
سوادکوه\0\
شیرگاه\0\
عباس آباد\0\
قائمشهر\0\
کجور\0\
کلاردشت\0\
گلوگاه\0\
میاندورود\0\
نکاء\0\
نور\0\
نوشهر\0\
هراز و محمودآباد\0\
آزادشهر\0\
آق قلا\0\
بندرترکمن\0\
بندرگز\0\
رامیان\0\
علی آباد\0\
کردکوی\0\
کلاله\0\
گرگان\0\
گمیشان\0\
گنبد کاووس\0\
مراوه تپه\0\
مینودشت\0\
آستارا\0\
آستانه\0\
املش\0\
بندرانزلی\0\
خمام\0\
رحیم آباد\0\
رشت\0\
رضوانشهر\0\
رودبار\0\
رودسر\0\
سنگر\0\
سیاهکل\0\
شفت\0\
صومعه سرا\0\
طالش\0\
عمارلو\0\
فومن\0\
کوچصفهان\0\
لاهیجان\0\
لشت نشاء\0\
لنگرود\0\
ماسال و شاندرمن\0\
اسلام آباد\0\
باینگان\0\
پاوه\0\
ثلاث باباجانی\0\
جوانرود\0\
حمیل\0\
روانسر\0\
سرپل ذهاب\0\
سنقر\0\
صحنه\0\
قصرشیرین\0\
کرمانشاه\0\
کرند\0\
کنگاور\0\
گیلانغرب\0\
هرسین\0\
باشت\0\
بویراحمد(یاسوج)\0\
بهمنی\0\
چاروسا\0\
دروهان\0\
کهکیلویه(دهدشت)\0\
گچساران(دوگنبدان)\0\
لنده\0\
مارگون\0\
بانه\0\
بیجار\0\
دهگلان\0\
دیواندره\0\
سروآباد\0\
سقز\0\
سنندج\0\
قروه\0\
کامیاران\0\
کرانی\0\
مریوان\0\
نمشیر\0\
ارزونیه\0\
انار\0\
بافت\0\
بردسیر\0\
بم\0\
جیرفت\0\
رابر\0\
راور\0\
راین\0\
رفسنجان\0\
رودبار کهنوج\0\
ریگان\0\
زرند\0\
سیرجان\0\
شهداد\0\
شهربابک\0\
عنبرآباد\0\
فهرج\0\
قلعه گنج\0\
کرمان\0\
کوهبنان\0\
کهنوج\0\
گلباف\0\
ماهان\0\
منوجان\0\
آبیک\0\
آوج\0\
البرز\0\
بوئین زهرا\0\
تاکستان\0\
رودبار الموت\0\
رودبار شهرستان\0\
ضیاءآباد\0\
طارم سفلی\0\
قزوین\0\
قم\0\
کهک\0\
آباده\0\
آباده طشک\0\
ارسنجان\0\
استهبان\0\
اشکنان\0\
اقلید\0\
اوز\0\
بوانات\0\
بیضا\0\
جویم\0\
جهرم\0\
حاجی آباد(زرین دشت)\0\
خرامه\0\
خشت و کمارج\0\
خفر\0\
داراب\0\
سپیدان\0\
سروستان\0\
سعادت آباد\0\
شیبکوه\0\
شیراز\0\
فراشبند\0\
فسا\0\
فیروزآباد\0\
قنقری(خرم بید)\0\
قیروکارزین\0\
کازرون\0\
کوار\0\
کراش\0\
لارستان\0\
لامرد\0\
مرودشت\0\
ممسنی\0\
مهر\0\
نی ریز\0\
ایوانکی\0\
بسطام\0\
بیارجمند\0\
دامغان\0\
سمنان\0\
شاهرود\0\
گرمسار\0\
مهدیشهر\0\
میامی\0\
ایرانشهر\0\
بزمان\0\
بمپور\0\
چابهار\0\
خاش\0\
دشتیاری\0\
راسک\0\
زابل\0\
زابلی\0\
زاهدان\0\
سراوان\0\
سرباز\0\
سیب و سوران\0\
شهرکی و ناروئی(زهک)\0\
شیب آب\0\
فنوج\0\
قصرقند\0\
کنارک\0\
لاشار(اسپکه)\0\
میرجاوه\0\
نیک شهر\0\
آبادان\0\
آغاجاری\0\
اروندکنار\0\
امیدیه\0\
اندیکا\0\
اندیمشک\0\
اهواز\0\
ایذه\0\
باغ ملک\0\
بندر امام خمینی\0\
بندرماهشهر\0\
بهبهان\0\
خرمشهر\0\
دزفول\0\
دشت آزادگان\0\
رامشیر\0\
رامهرمز\0\
سردشت\0\
شادگان\0\
شاوور\0\
شوش\0\
شوشتر\0\
گتوند\0\
لالی\0\
مسجدسلیمان\0\
هندیجان\0\
هویزه\0\
احمدآباد\0\
بجستان\0\
بردسکن\0\
تایباد\0\
تخت جلگه\0\
تربت جام\0\
تربت حیدریه\0\
جغتای\0\
جوین\0\
چناران\0\
خلیل آباد\0\
خواف\0\
درگز\0\
رشتخوار\0\
زبرخان\0\
سبزوار\0\
سرخس\0\
فریمان\0\
فیض آباد\0\
قوچان\0\
کاشمر\0\
کلات\0\
گناباد\0\
مشهد\0\
مشهد منطقه2\0\
مشهد منطقه3\0\
مشهد منطقه1\0\
نیشابور\0\
اسفراین\0\
بجنورد\0\
جاجرم\0\
رازوجرکلان\0\
شیروان\0\
فاروج\0\
مانه و سملقان\0\
اردل\0\
بروجن\0\
شهرکرد\0\
فارسان\0\
فلارد\0\
کوهرنگ\0\
کیار\0\
گندمان\0\
لردگان\0\
میانکوه\0\
بشرویه\0\
بیرجند\0\
درمیان\0\
زیرکوه\0\
سرایان\0\
سربیشه\0\
فردوس\0\
قائنات\0\
نهبندان\0\
بندر دیلم\0\
بندر گناوه\0\
بوشهر\0\
تنگستان\0\
جم\0\
دشتستان\0\
دشتی\0\
دلوار\0\
دیر\0\
سعد آباد\0\
شبانکاره\0\
کنگان\0\
اسلامشهر\0\
پاکدشت\0\
تهران مرکزی\0\
تهران جنوب\0\
تهران شرق\0\
تهرانشمال\0\
تهران غرب\0\
دماوند\0\
رباط کریم\0\
ساوجبلاغ\0\
شمیران\0\
شهرری\0\
شهریار\0\
طالقان\0\
فیروزکوه\0\
کرج\0\
کهریزک\0\
نظرآباد\0\
ورامین\0\
امور خارجه\0\
آبدانان\0\
ارکوازی(ملکشاهی)\0\
ایلام\0\
ایوان\0\
بدره\0\
دره شهر\0\
دهلران\0\
زرین آباد\0\
شیروان لومار\0\
شیروان و چرداول\0\
موسیان\0\
مهران\0\
اردبیل\0\
ارشق\0\
انگوت\0\
بیله سوار\0\
پارس آباد\0\
خلخال\0\
خورش رستم\0\
سرعین\0\
سنجبد(کوثر)\0\
مشکین شهر\0\
مغان\0\
نمین\0\
نیر\0\
آران و بیدگل\0\
اردستان\0\
اصفهان\0\
باغ بهادران\0\
بوئین و میاندشت\0\
تیران و کرون\0\
جرقویه\0\
چادگان\0\
خمینی شهر\0\
خوانسار\0\
خور و بیابانک\0\
دولت آباد\0\
سمیرم\0\
سمیرم سفلی (دهاقان)\0\
شاهین شهر\0\
شهرضا\0\
فریدن\0\
فریدونشهر\0\
فلاورجان\0\
کاشان\0\
کوهپایه\0\
گلپایگان\0\
لنجان(زرینشهر)\0\
مبارکه\0\
میمه\0\
نائین\0\
نجف آباد\0\
نطنز\0\
زنجان\0\
ملکان\0\
مرند\0\
ابهر و خرمدره\0\
میانه\0";

#endif
